
{"AllFoods":[{"categoryName":"Desserts","receipes":[{"name":"Kinder Bueno cheesecake","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/Kinder Bueno cheesecake.jpg","timetoprepare":"45 m","smalldescription":"t's the ultimate easy dessert recipe but is guaranteed to wow everyone!","ingredients":["200g digestive biscuits","5 x 43g Kinder Bueno Chocolate Bars","100g butter, melted","60ml (1/4 cup) boiling water","2 1/2 tsps gelatine powder","180g pkt milk chocolate, chopped","375ml (1 1/2 cups) thickened cream","2 x 43g Kinder Bueno Chocolate Bars, broken into small pieces","Cocoa powder, to dust"],"steps":["Line the base and sides of a 20cm springform pan with baking paper. ","Place the biscuits Unsure of the quantity needed? Click on the underlined ingredient to reveal the quantity. No need to flip back and forth!  OK, GOT IT  and 1 Kinder Bueno bar (2 sticks) in a food processor. Process until fine crumbs form. Add the butter and process until combined. Transfer to prepared pan. Use a straight-sided glass to spread and press the biscuit mixture firmly over the base of the pan. Place in the fridge until required.","Place the boiling water in a small heatproof jug. Sprinkle with the gelatine. Whisk with a fork until dissolved. Set aside to cool slightly.","Place the milk chocolate in a heatproof bowl set over a saucepan of simmering water (don't let the bowl touch the water). Stir with a metal spoon until smooth. Set aside to cool slightly.","Place the cream cheese, sugar and vanilla in a food processor. Process until smooth. Add 250ml (1 cup) of the cream and process until combined. Add melted chocolate and process until combined. Add gelatine mixture and process until combined.","Pour half the cheesecake mixture into the prepared pan. Arrange rows of other 4 Kinder Bueno bars, about 1.5cm apart, trimming to fit, over cheesecake mixture. Top with remaining cheesecake mixture. Smooth top. Place in the fridge for 4 hours or overnight until set.","Remove cheesecake from the pan and place on a serving plate. Use electric beaters to beat the remaining 125ml (1/2 cup) cream until soft peaks form. Top cheesecake with cream. Dust with cocoa and decorate with remaining Kinder Bueno bars. Serve."]},{"name":"Apple danish custard slice","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/Apple danish custard slice.png","timetoprepare":"30 m","smalldescription":"This combo recipe brings together the apple Danish and the custard slice, for that perfect sweet treat","ingredients":["400g Sara Lee Apple Danish ","3 tbsp custard powder ","250ml (1 cup) milk ","60ml (1/4 cup) boiling water","125ml (1/2 cup) caramel top n fill ","180g pkt milk chocolate, chopped","1 tsp powdered gelatin "],"steps":["Cook the apple danish according to packet instructions. Transfer to a 20cm x 10cm loaf pan. ","Place custard powder, sugar and 50ml of milk in a large saucepan. Stir to form a thin paste. Stir in remaining milk and cream. Bring to the boil over medium heat, whisking continuously. Cook for a further 1 to 2 minutes. Remove from heat. Spoon custard over danish, gently spreading to make an even layer. Refrigerate for 1 hour or until set. ","Make caramel topping: whisk caramel and thickened cream in a small saucepan over low heat until warmed slightly. Remove from heat. Place gelatin in a small bowl. Pour over 1 tablespoon boiling water and whisk until dissolved. Add to caramel, stirring occasionally, until mixture has cooled. Pour over custard and refrigerate for 1 hour or until set. Cut into slices to serve. "]}]},{"categoryName":"Main Dishes","receipes":[{"name":"honey garlic chicken","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/honey garlic chicken.jpg","timetoprepare":"15 m","smalldescription":"A 5-ingredient, 15-minute honey garlic chicken with an addictively delicious sauce ","ingredients":["2 teaspoons olive oil (or canola oil)","1 1/2 pounds boneless, skinless chicken breasts, cut into small cubes (about 1/2 inch) ","Salt and black pepper ","3 tablespoons honey ","3 tablespoons low-sodium soy sauce ","3 cloves garlic, minced ","1/4 teaspoon red pepper flakes (optional, adjust for heat) "],"steps":["Heat olive oil in a large skillet over medium-high heat.","Lightly season the cubed chicken with salt and pepper. (Go easy because the soy sauce has plenty of sodium.)","Add the chicken to the skillet and brown on one side, about 3-4 minutes. ","Meanwhile, make the glaze. Whisk the honey, soy sauce, garlic and red pepper flakes, if using, in a small bowl until well combined. ","Add the sauce to the pan and toss to coat the chicken pieces. Cook until chicken is cooked through, 4-5 more minutes. ","Serve with steamed rice and top with green onions, sesame seeds and a squeeze of lime juice, if desired. "]},{"name":"Creamy Herb Chicken","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/Creamy Herb Chicken.jpg","timetoprepare":"45 m","smalldescription":"Delicious Creamy Herb Chicken","ingredients":["4 chicken breasts (pounded 1/2-inch thin) ","2 teaspoons each of onion powder and garlic powder ","1 teaspoon fresh chopped parsley ","1/2 teaspoon each of dried thyme and dried rosemary* ","4 cloves garlic , minced (or 1 tablespoon minced garlic)","1 cup milk (or half and half)*","Salt and freshly ground black pepper , to taste"],"steps":["Coat chicken breasts with the onion and garlic powders and herbs. Season generously with salt and pepper. ","Heat 1 tablespoon of oil a large pan or skillet over medium-high heat and cook chicken breasts until opaque and no longer pink inside (about 5 minutes each side, depending on thickness). Transfer to a plate; set aside. ","To the same pan or skillet, heat another 2 teaspoons of olive oil and saut'e9 garlic, with parsley, thyme and rosemary, for about 1 minute, or until fragrant. ","Stir in milk (or cream); season with salt and pepper, to taste. ","Bring to a boil; add the cornstarch mixture to the centre of the pan, quickly stirring, until sauce has thickened slightly. Reduce heat and simmer gently for a further minute to allow the sauce to thicken more. ","Return chicken to the skillet. Sprinkle with extra herbs if desired. Serve immediately. "]},{"name":"chicken stroganoff","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/chicken stroganoff.jpg","timetoprepare":"55 m","smalldescription":"amazing chicken stroganoff","ingredients":["2 large chicken breasts, (cut in half horizontally to make 4 fillets) ","1/2 teaspoon EACH garlic powder, onion powder and paprika ","1/2 teaspoon salt ","1/4 teaspoon fresh cracked black pepper ","3 tablespoons flour ","2 tablespoons butter, ","1 tablespoon olive oil ","3 tablespoons butter ","1 pound (500 grams) brown mushrooms, sliced ","1/2 cup dry white wine, (substitute with chicken stock/broth) ","2 cups low sodium chicken stock/broth ","Fresh chopped parsley or chives, to serve ","1/2 cup sour cream "],"steps":["Season chicken all over with garlic powder, paprika, salt and pepper. Dredge each chicken breast in flour. Set aside. ","Heat the butter and oil in a large skillet over medium heat. Sear the chicken until browned, (about 4 minutes each side). Transfer to a plate, set aside.  ","Melt the remaining butter in the pan. Saut'e9 the onions until transparent. Add the garlic and saut'e9 until fragrant (about 30 seconds), then add mushrooms and cook until golden, about 4 minutes. Scrape any browned bits from the bottom of the skillet (=flavour). Add in the mustard and paprika, mixing well to coat mushrooms. ","Pour in the wine (or stock) to deglaze the pan, and let reduce for about 3 minutes while stirring occasionally to mix all of the flavours through. ","Reduce heat to medium-low and stir in sour cream. It may 'look' split, but the sour cream will melt through the sauce while it heats through. Let simmer until sauce is smooth and creamy, about 3-4 minutes, then season with salt and pepper. ","Return chicken breasts along with juices on the plate to the pan. Simmer for a further 2 minutes until the chicken is completely cooked through. (If sauce is too thin, simmer for a minute or 2 longer until the sauce thickens from the floured coating on the chicken.) Remove from heat. ","Garnish with parsley or chives. Serve over noodles, pasta, mashed potatoes or rice. "]},{"name":"creamy chicken alfredo ","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/creamy chicken alfredo.jpg","timetoprepare":"45 m","smalldescription":"the most delicious alfredo in the world","ingredients":["500 g boneless skinless chicken thighs, (or breasts) ","Salt and pepper, to season ","1 onion, diced ","4 cloves garlic, minced (or 1 tablespoon minced garlic) ","1/2 cup (125 ml) dry white wine, (optional) ","8 oz (250 g) brown mushrooms, sliced ","2 cups (500 ml) chicken broth, or stock ","1 1/2 cups (375 ml) heavy cream, divided (thickened cream, light cream, evaporated milk can also be used) ","Extra salt and pepper, to taste ","8 oz (250 g) dry pasta, penne or fettuccini ","1 1/2 cups freshly grated parmesan cheese ","Fresh chopped parsley, to garnish "],"steps":["Season chicken thighs with salt and pepper. ","Heat half of the oil in a large pot over medium-high heat. Add the chicken thighs and sear on both sides until golden brown and cooked through. Remove chicken and set aside. ","Add the remaining oil in the pot. Fry onion until transparent, stirring occasionally (about 2 minutes). Saut'e9 the garlic until fragrant (30 seconds), then add in the white wine and allow to reduce to half (about 4-5 minutes). Add the mushrooms and cook for about a minute, while stirring occasionally. ","Pour in broth and 1 cup of cream (or evaporated milk); season with salt and pepper. Bring to a gentle simmer then add the pasta. Mix well, reduce the heat to a slow simmer while stirring occasionally, until pasta is al dente (about 15 minutes).  ","Stir in the parmesan cheese until it melts through the sauce. Remove from heat immediately and slowly add in 1/4-1/2 cup remaining cream if sauce it too thick for your liking. Adjust salt and pepper to your taste. ","Slice the chicken into strips and stir through the pasta. Garnish with fresh parsley and extra parmesan, if desired "]}]},{"categoryName":"Salads","receipes":[{"name":"spinach apple salad","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/spinach apple salad.jpg","timetoprepare":"25 m","smalldescription":"spinach apple salad to die for","ingredients":["'bd cup Glazed Walnuts or Glazed Pecans (or toasted walnuts or toasted pecans)","1 recipe Best Balsamic Dressing","1 apple","1 ripe pear ","3 cups baby spinach leaves ","3 cups baby mixed greens "],"steps":["Make the Glazed Walnuts or Glazed Pecans. (While they cook, prep the rest of the salad. Or, you can make these ahead!) ","Make the Best Balsamic Dressing. ","Core the apple and pear, cut them into thin slices. ","Place the greens on serving plates and top with apples, pears, and walnuts. Pour over the dressing and serve. (Pro tip: Dress it up by adding cubed Manchego cheese!) "]},{"name":"kale salad","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/Creamy Herb Chicken.jpg","timetoprepare":"20 m","smalldescription":"kale salad for a fit body","ingredients":["1 large bunch Tuscan kale (about 8 ounces)* ","1 very small or 1/2 medium garlic clove ","'bc teaspoon kosher salt ","1 lemon (3 to 4 tablespoons juice, plus zest) ","'bc cup freshly grated Parmesan cheese ","Fresh ground black pepper ","Homemade croutons (optional) "],"steps":["Wash and dry the kale. Then destem and roughly chop the kale leaves. ","Peel and mince the garlic clove. Sprinkle it with the kosher salt, then holding the blunt edge of the knife, scrape the sharp edge of the blade over the minced garlic, holding the knife at an angle and mashing the garlic into a paste. ","Toss the dressing with the kale leaves. Serve topped with lemon zest (and additional Parmesan cheese, if desired).  If desired, serve with homemade croutons. "]},{"name":"Italian Salad","imageurl":"https://bucketappinc.s3.us-west-2.amazonaws.com/Italian Salad.jpg","timetoprepare":"35 m","smalldescription":"Super Delicious Italian Salad","ingredients":["1/2 recipe Homemade Croutons (or use purchased or omit for gluten-free) ","1 recipe Homemade Italian Dressing ","1 Romaine heart (3 cups) ","5 cups butter lettuce ","1 handful sliced red onion ","'bd cup sliced cherry tomatoes ","'bd cup sliced black olives (or halved olives) ","'bd cup jarred sliced pepperoncini ","'bc cup large Parmesan shavings (omit for vegan) "],"steps":["Make the homemade croutons (or make them in advance).  ","Make the Italian dressing. ","Chop romaine and lettuce. Thinly slice the red onion. Slice the tomatoes in half.  ","Place the greens in bowls, then top with the vegetables, olives, pepperoncini, Parmesan shavings, and croutons, then drizzle with dressing. Or, you can place them all together in a large serving bowl and toss with the dressing. (If making in advance, refrigerate the components separately and keep the croutons at room temperature. Bring the dressing to room temperature before serving.) "]}]}]}
